In [1]:
import numpy as np
import pandas as pd

In [7]:
arr = np.array([1, 2, 3, 4, 5], dtype=np.float64)

s = pd.Series([1, 2, 3, 4, 5], dtype=np.float64)
print(s)
print(s.values)
print(s.index)
print(s.dtype)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64
[1. 2. 3. 4. 5.]
RangeIndex(start=0, stop=5, step=1)
float64

In [11]:
s = pd.Series([1, 2, 3, 4, 5], dtype=np.float64, index=[0, 2, 100, 6, 9])

print(s)
print(s[0])
print(s[100])

0      1.0
2      2.0
100    3.0
6      4.0
9      5.0
dtype: float64
1.0
3.0

In [13]:
s = pd.Series([1, 2, 3, 4, 5],
             dtype=np.float64,
             index=['c', 'b', 'c', 'k', 'm'])

print(s)
print(s['c'])

c    1.0
b    2.0
c    3.0
k    4.0
m    5.0
dtype: float64
c    1.0
c    3.0
dtype: float64

In [14]:
s = pd.Series([1, 2, 3, 4, 5],
             dtype=np.float64,
             index=['c', 'b', 'a', 'k', 'm'])

print(s)
print(s[s % 2 == 0])
print(s[[0, 2]])

c    1.0
b    2.0
a    3.0
k    4.0
m    5.0
dtype: float64
b    2.0
k    4.0
dtype: float64
c    1.0
a    3.0
dtype: float64

In [15]:
my_dict = {'서울': 1000,
           '인천': 500,
           '제주': 200}

s = pd.Series(my_dict)
print(s)

서울    1000
인천     500
제주     200
dtype: int64

In [30]:
from datetime import datetime, timedelta

start_day = datetime(2020, 1, 1)

s1 = pd.Series([int(x) for x in np.random.normal(50, 5, (10,))],
              index=[start_day + timedelta(days=x) for x in range(10)])
print(s1)

s2 = pd.Series([int(x) for x in np.random.normal(70, 8, (10,))],
              index=[start_day + timedelta(days=x) for x in range(10)])
print(s2)

print(s1 + s2)

2020-01-01    31
2020-01-02    58
2020-01-03    45
2020-01-04    38
2020-01-05    39
2020-01-06    47
2020-01-07    47
2020-01-08    53
2020-01-09    45
2020-01-10    51
dtype: int64
2020-01-01    66
2020-01-02    65
2020-01-03    67
2020-01-04    61
2020-01-05    68
2020-01-06    60
2020-01-07    69
2020-01-08    61
2020-01-09    70
2020-01-10    71
dtype: int64
2020-01-01     97
2020-01-02    123
2020-01-03    112
2020-01-04     99
2020-01-05    107
2020-01-06    107
2020-01-07    116
2020-01-08    114
2020-01-09    115
2020-01-10    122
dtype: int64

In [35]:
start_day_A_factory = datetime(2020, 1, 1)
start_day_B_factory = datetime(2020, 1, 5)

s1 = pd.Series([int(x) for x in np.random.normal(50, 5, (10,))],
              index=[start_day_A_factory + timedelta(days=x) for x in range(10)])

print(s1)

s2 = pd.Series([int(x) for x in np.random.normal(70, 8, (10,))],
              index=[start_day_B_factory + timedelta(days=x) for x in range(10)])

print(s2)

print(s1 + s2)

2020-01-01    51
2020-01-02    48
2020-01-03    44
2020-01-04    49
2020-01-05    52
2020-01-06    46
2020-01-07    53
2020-01-08    50
2020-01-09    41
2020-01-10    55
dtype: int64
2020-01-05    74
2020-01-06    70
2020-01-07    68
2020-01-08    80
2020-01-09    72
2020-01-10    57
2020-01-11    78
2020-01-12    72
2020-01-13    69
2020-01-14    76
dtype: int64
2020-01-01      NaN
2020-01-02      NaN
2020-01-03      NaN
2020-01-04      NaN
2020-01-05    126.0
2020-01-06    116.0
2020-01-07    121.0
2020-01-08    130.0
2020-01-09    113.0
2020-01-10    112.0
2020-01-11      NaN
2020-01-12      NaN
2020-01-13      NaN
2020-01-14      NaN
dtype: float64

In [48]:
my_dict = {'이름': ['홍길동', '아이유', '김연아', '신사임당'],
           '학년': [4, 3, 1, 2],
           '학점': [1.5, 2.4, 3.9, 3.2]}

df = pd.DataFrame(my_dict)
display(df)

print(df.shape)
print(df.values)
print(df.size)
print(df.ndim)
print(df.index)
print(df.columns)

df.index.name = '학번'
df.columns.name = '학생정보'
df

     이름  학년   학점
0   홍길동   4  1.5
1   아이유   3  2.4
2   김연아   1  3.9
3  신사임당   2  3.2

(4, 3)
[['홍길동' 4 1.5]
 ['아이유' 3 2.4]
 ['김연아' 1 3.9]
 ['신사임당' 2 3.2]]
12
2
RangeIndex(start=0, stop=4, step=1)
Index(['이름', '학년', '학점'], dtype='object')

학생정보    이름  학년   학점
학번
0      홍길동   4  1.5
1      아이유   3  2.4
2      김연아   1  3.9
3     신사임당   2  3.2

In [51]:
my_dict = {'이름': ['홍길동', '아이유', '김연아', '신사임당'],
           '학년': [4, 3, 1, 2],
           '학점': [1.5, 2.4, 3.9, 3.2]}

df = pd.DataFrame(my_dict)
df

new_df = df.rename(columns={'이름':'학생이름',
                            '학점':'평균평점'},
                   index={0:'one'},
                   inplace=False)

new_df

     학생이름  학년  평균평점
one   홍길동   4   1.5
1     아이유   3   2.4
2     김연아   1   3.9
3    신사임당   2   3.2

In [53]:
my_dict = {'이름': ['홍길동', '아이유', '김연아', '신사임당'],
           '학년': [4, 3, 1, 2],
           '학점': [1.5, 2.4, 3.9, 3.2]}

df = pd.DataFrame(my_dict)

new_df = df.set_index('이름', inplace=False)
new_df

      학년   학점
이름
홍길동    4  1.5
아이유    3  2.4
김연아    1  3.9
신사임당   2  3.2

In [54]:
df = pd.read_csv('./data/student.csv')
df

    이름  입학연도   성적
0  아이유  2015  1.5
1  김연아  2016  2.0
2  홍길동  2015  3.1
3  강감찬  2017  1.1
4  이순신  2016  2.7